artillery.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 20
scenarios:
  # - flow:
  #     - post:
  #         url: "/users"
  #         json:
  #           name: "Test"
  #           email: "test@example.com"
  #           password: "Password123"

  - flow:
      - post:
          url: "/todos"
          json:
            title: "Test Artillery To Do"
            description: "It's a test."
            completed: false
      - get:
          url: "/todos"